---
kind: method
id: M:Autodesk.Revit.DB.Structure.Truss.DetachChord(Autodesk.Revit.DB.Structure.TrussChordLocation)
zh: 桁架
source: html/a4540c86-9de5-1b40-1839-99d7224d4cde.htm
---
# Autodesk.Revit.DB.Structure.Truss.DetachChord Method

**中文**: 桁架

Detach a truss's specific chord from the element to which it is attached.

## Syntax (C#)
```csharp
public void DetachChord(
	TrussChordLocation location
)
```

## Parameters
- **location** (`Autodesk.Revit.DB.Structure.TrussChordLocation`) - The chord.